Repository: OrbitalRaph/final_web_angular
Catalog: src/locale/messages.*.xlf
Languages: fr_ca

source: final website project - Character management
fr_ca: Projet de site web final - Gestion de personnages

source: By: Raphaël Boisvert
fr_ca: Par: Raphaël Boisvert

source: This website allows you to manage video game characters.<br> It is possible to add, modify and delete characters and more.<br> I ran out of time and the project is not perfect, but it works. (I think)
fr_ca: Ce site web vous permet de gérer des personnages de jeux vidéo.<br> Il est possible d'ajouter, modifier et supprimer des personnages et plus encore.<br> J'ai manqué de temps et le projet n'est pas parfait, mais il fonctionne. (Je crois)

source: Add a character
fr_ca: Ajouter un personnage

source: Name is required
fr_ca: Le nom est requis

source: Title is required
fr_ca: Le titre est requis

source: Description is required
fr_ca: La description est requise

source: Weapon type is required
fr_ca: Le type d'arme est requis

source: Element is required
fr_ca: L'élément est requis

source: Affiliation is required
fr_ca: L'affiliation est requise

source: Region is required
fr_ca: La région est requise

source: Rarity is required
fr_ca: La rareté est requise

source: Format: YYYY-MM-DD
fr_ca: Format: AAAA-MM-JJ

source: Invalid format
fr_ca: Format invalide

source: Birthday is required
fr_ca: La date de naissance est requise

source: Constellation is required
fr_ca: La constellation est requise

source: Character's page
fr_ca: Page des personnage

source: This page displays the list of characters from the Genshin Impact game registered on the site.
fr_ca: Cette page affiche la liste des personnages du jeu Genshin Impact enregistrés sur le site.

source: You can filter the list by selecting attributes:
fr_ca: Vous pouvez filtrer la liste en sélectionnant des attributs :

source: Element :
fr_ca: Élément :

source: Weapon type :
fr_ca: Type d'arme :

source: Rarity :
fr_ca: Rareté :

source: You can also add a character by clicking on the button below:
fr_ca: Vous pouvez également ajouter un personnage en cliquant sur le bouton ci-dessous :

source: Weapon type: {{character.weapon_type}}
fr_ca: Type d'arme : {{character.weapon_type}}

source: Element: {{character.element}}
fr_ca: Élément : {{character.element}}

source: Region: {{character.region}}
fr_ca: Région : {{character.region}}

source: Rarity: {{character.rarity}}
fr_ca: Rareté : {{character.rarity}}

source: Birthday: {{formatBirthday(character.birthday)}}
fr_ca: Date de naissance : {{formatBirthday(character.birthday)}}

source: Skills
fr_ca: Compétences

source: Modify a character
fr_ca: Modifier un personnage

source: Modify
fr_ca: Modifier

source: Home
fr_ca: Accueil

source: Characters
fr_ca: Personnages

source: Statistics
fr_ca: Statistiques

source: Statistics' page
fr_ca: Page des statistiques

source: This page displays statistics on the number of characters registered on the site.
fr_ca: Cette page affiche des statistiques sur le nombre de personnages enregistrés sur le site.

source: Number of characters by element
fr_ca: Nombre de personnages par élément

source: Number of characters by weapon type
fr_ca: Nombre de personnages par type d'arme

source: Number of characters by rarity
fr_ca: Nombre de personnages par rareté
